Repository: AngelPuch/MindWeaveClient
Catalog: MindWeaveClient/Properties/Langs/Lang.*.resx
Languages: es

# GlobalLbBirth
source: Date of birth
es: Fecha de nacimiento

# GlobalLbEmail
source: Email
es: Correo electrónico

# LogInLbPassword
source: Password
es: Contraseña

# GlobalLbLastName
source: Last name
es: Apellidos

# GlobalLbUsername
source: Username
es: Nombre de usuario

# LoginBtnGuest
source: Play as guest
es: Jugar como invitado

# LogInBtnLogin
source: Log In
es: Iniciar sesión

# LogInBtnRecover
source: Forgot your password?
es: ¿Olvidaste tu contraseña?

# GlobalBtnSignUp
source: Sign Up
es: Registrarse

# SignUpLbNewAccount
source: Create your account
es: Crear una cuenta

# SignUpRbFemale
source: Female
es: Femenino

# SignUpRbMale
source: Male
es: Masculino

# SignUpRbNoSay
source: Prefer not to say
es: Prefiero no decirlo

# SignUpRbOther
source: Other
es: Otro

# SignUpLbAlreadyAccount
source: Already have an account? Log in
es: ¿Ya tienes una cuenta? Inicia sesión

# GlobalBtnPlay
source: PLAY
es: JUGAR

# MainMenuBtnProfile
source: PROFILE
es: PERFIL

# GlobalCommonSocial
source: SOCIAL
es: AMIGOS

# GlobalCommonSettings
source: SETTINGS
es: AJUSTES

# LobbyLbTitle
source: Lobby
es: Sala

# LobbyLbPlayers
source: PLAYERS:
es: JUGADORES:

# LobbyLbWaiting
source: Waiting...
es: Esperando...

# LobbyBtnUploadImage
source: Upload Image...
es: Subir imagen...

# LobbyLbDifficulty
source: DIFFICULTY:
es: DIFICULTAD:

# LobbyBtnInvite
source: Invite friends
es: Invitar amigos

# InGameLbTime
source: Time:
es: Tiempo:

# InGameLbScore
source: Score:
es: Puntuación:

# ProfileLbHi
source: ¡HI,
es: ¡HOLA,

# ProfileLbStats
source: Stats & progression
es: Estadísticas y progreso

# ProfileLbPuzzlesCompleted
source: Puzzles completed:
es: Puzles completados:

# ProfileLbPuzzlesWon
source: Puzzles won:
es: Puzles ganados:

# ProfileLbTotalPlaytime
source: Total playtime:
es: Tiempo total de juego:

# ProfileLbHighestScore
source: Highest Score:
es: Puntuación más alta:

# ProfileLbAchievements
source: Achievements
es: Logros

# GlobalCommonEditProfile
source: Edit profile
es: Editar perfil

# GlobalLbFirstName
source: First Name
es: Nombre

# EditProfileBtnChangePassword
source: Change password
es: Cambiar contraseña

# EditProfileBtnSaveChanges
source: Save changes
es: Guardar cambios

# SocialBtnFriendsList
source: Friends list
es: Lista de amigos

# GlobalBtnAddFriend
source: Add friend
es: Agregar amigo

# SocialBtnRequests
source: Requests
es: Solicitudes

# SocialLbOnline
source: Online
es: En línea

# SocialLbOffline
source: Offline
es: Desconectado

# SocialLbSearch
source: Search
es: Buscar

# SocialLbSearchResult
source: Search result:
es: Resultado de la búsqueda:

# SocialLbReceivedRequests
source: Received requests:
es: Solicitudes recibidas:

# SocialBtnAccept
source: Accept
es: Aceptar

# SocialBtnDecline
source: Decline
es: Rechazar

# SocialLbSentRequests
source: Sent requests:
es: Solicitudes enviadas

# GlobalBtnCancel
source: Cancel
es: Cancelar

# GlobalBtnBack
source: Back
es: Atrás

# SettingsLbSound
source: SOUND
es: SONIDO

# SettingsLbMusic
source: MUSIC
es: MÚSICA

# SettingsLbSoundEffects
source: SOUND EFFECTS
es: EFECTOS DE SONIDO

# SettingsLbVibration
source: VIBRATION
es: VIBRACIÓN

# SettingsLbLanguage
source: LANGUAGE
es: IDIOMA

# SettingsOptEnglish
source: ENGLISH
es: INGLÉS

# SettingsOptSpanish
source: SPANISH
es: ESPAÑOL

# SettingsBtnCredits
source: CREDITS
es: CRÉDITOS

# SettingsBtnReloadProgress
source: RELOAD PROGRESS
es: RECARGAR PROGRESO

# SettingsBtnSaveExit
source: SAVE AND EXIT
es: GUARDAR Y SALIR

# GlobalLbPasswordRecovery
source: Password recovery
es: Recuperar contraseña

# PasswordRecoveryLbUserEmail
source: Username or email
es: Nombre de usuario o correo

# PasswordRecoveryBtnSendCode
source: Send code to email
es: Enviar código al correo

# PasswordRecoveryLbInstructions
source: We've sent a code to your email. Check your inbox (or spam folder) and enter it below.
es: Te hemos enviado un código a tu correo electrónico. Revisa tu bandeja de entrada (o carpeta de correo no deseado) e introdúcelo a continuación.

# PasswordRecoveryBtnResend
source: Didn't receive the code? Resend
es: ¿No recibiste el código? Reenviar

# PasswordRecoveryBtnVerifyCode
source: Verify code
es: Verificar código

# PasswordRecoveryLbSetNew
source: Set new password
es: Establecer nueva contraseña

# PasswordRecoveryLbConfirmPassword
source: Confirm new password
es: Confirmar nueva contraseña

# PasswordRecoveryBtnSave
source: Save
es: Guardar

# GlobalTxtNewPassword
source: New password
es: Contraseña nueva

# InfoMsgTitleSuccess
source: Success
es: Éxito

# InfoMsgBodyCodeSent
source: Code sent successfully
es: Código enviado con éxito

# LobbyTxtSearchFriends
source: Search friends!
es: ¡Busca amigos!

# VerificationAccountLbTitle
source: Verify Your Account
es: Verifica tu cuenta

# VerificationAccountLbInstructions
source: We've sent a 6-digit code to your email. Please enter it below to activate your account.
es: Te hemos enviado un código de 6 dígitos a tu correo electrónico. Introdúcelo a continuación para activar tu cuenta.

# VerificationAccountBtnVerify
source: Verify Account
es: Verificar cuenta

# VerificationCodeResend
source: Didn't receive the code? Resend
es: ¿No recibiste el código? Reenviar.

# VerificationCodeInvalidFormat
source: The verification code must contain 6 digits only.
es: El código de verificación solo debe contener 6 dígitos.

# ErrorFailedToLoadProfile
source: Error al cargar los datos del perfil
es: Error al cargar los datos.

# ProfileLbPersonalInfo
source: Personal Information
es: Información Personal

# GlobalLbGender
source: Gender
es: Género

# EditProfileTitle
source: Edit Profile
es: Editar Perfil

# EditProfileBtnChangeAvatar
source: Change Avatar
es: Cambiar Avatar

# SelectAvatarTitle
source: Select your Avatar!
es: ¡Selecciona tu Avatar!

# LoginAccountNotVerified
source: Account not verified
es: Cuenta no verificada

# MainMenuBtnCreateLobby
source: Create Lobby
es: Crear Sala

# MainMenuLbJoinCodePrompt
source: Join Lobby by Code:
es: Unirse con un código:

# MainMenuBtnJoin
source: Join
es: Unirse

# ValidationPasswordsDoNotMatch
source: The passwords do not match.
es: Las contraseñas no coinciden.

# GlobalErrorAllFieldsRequired
source: All fields are required.
es: Todos los campos son requeridos.

# GlobalVerificationInvalidOrExpiredCode
source: Invalid or expired verification code.
es: Código de verificación inválido o expirado.

# SelectionPuzzleTitle
source: Select Puzzle
es: Seleccionar Puzzle

# SelectionPuzzleHeader
source: Select Puzzle & Difficulty
es: Selecciona Puzzle y Dificultad

# SelectionPuzzleUploadImageBtn
source: Upload Your Image
es: Sube tu propia imagen

# SelectionPuzzleCreateLobbyBtn
source: Create Lobby
es: Crear Sala

# DifficultyOptEasy
source: Easy (25 Pcs)
es: Fácil (25 Pzs)

# DifficultyOptMedium
source: Medium (50 Pcs)
es: Medio (50 Pzs)

# DifficultyOptHard
source: Hard (100 Pcs)
es: Difícil (100 Pzs)

# GlobalProcessing
source: Processing...
es: Procesando...

source: Error loading puzzles
es: Error al cargar puzzles

source: Error uploading image
es: Error al subir imagen

source: Upload successful!
es: ¡Imagen subida con éxito!

source: Upload Failed
es: Falló la subida

# CannotConnectMatchmaking
source: Cannot connect...service.
es: No se pudo conectar...

source: Failed to create lobby.
es: Error al crear la sala.

# SelectPuzzleImageTitle
source: Select Puzzle Image
es: Selecciona Imagen del Puzzle

# LobbyBtnInviteGuest
source: Invite Guest
es: Invitar Invitado

# GuestInvitePromptTitle
source: Invite Guest by Email
es: Invitar Invitado por Correo

# GuestInvitePromptMessage
source: Enter the email address of the guest you want to invite:
es: Ingresa la dirección de correo del invitado que deseas invitar:

# GuestInviteBtnSend
source: Send Invite
es: Enviar Invitación

# GuestJoinTitle
source: Join as Guest
es: Unirse como Invitado

# GuestJoinLbLobbyCode
source: Lobby Code
es: Código de Sala

# GuestJoinLbDesiredUsername
source: Desired Username
es: Nombre de Usuario Deseado

# GuestJoinBtnJoin
source: Join Lobby
es: Unirse a la Sala

# GuestJoinInfo
source: Enter the lobby code and your email (where you received the invite).
es: Ingresa el código de la sala y tu correo (donde recibiste la invitación).

# GuestUsernameValidationError
source: Guest username must be 3-16 alphanumeric characters.
es: El nombre de usuario invitado debe tener entre 3 y 16 caracteres alfanuméricos.

# ErrorInvalidOrExpiredGuestInvite
source: Invalid, expired, or already used lobby invitation code for this email.
es: Código de invitación inválido, expirado o ya usado para este correo.

# ErrorGuestUsernameGenerationFailed
source: Could not generate a unique guest username. Please try another name.
es: No se pudo generar un nombre de usuario único. Intenta con otro nombre.

# SuccessGuestJoinedLobby
source: Successfully joined the lobby as a guest.
es: Te has unido a la sala como invitado.

# ErrorSendingGuestInvitation
source: Failed to send the guest invitation. Please try again.
es: No se pudo enviar la invitación de invitado. Inténtalo de nuevo.

# GlobalErrorInvalidEmailFormat
source: Invalid email format.
es: Formato de correo inválido.

# WarningMsgSocialConnectFailed
source: Could not connect to social features. Friend lists and invites might not work.
es: No se pudo conectar a los servicios sociales. Las listas de amigos e invitaciones podrían no funcionar.

# WarningTitle
source: Warning
es: Advertencia

# WarningMsgMatchmakingConnectFailed
source: Could not connect to matchmaking service.
es: No se pudo conectar al servicio de emparejamiento.

# ErrorMsgServerOffline
source: The server is unavailable. Please try again later.
es: El servidor no está disponible. Por favor, inténtelo más tarde.

# ErrorMsgLoginFailed
source: An unexpected error occurred while logging in.
es: Ocurrió un error inesperado al iniciar sesión.

# ErrorMsgResendCodeFailed
source: An error occurred while resending the verification code.
es: Ocurrió un error al reenviar el código de verificación.

# ErrorMsgNoDetails
source: No details provided.
es: Sin detalles.

# ErrorTitleDetails
source: Details:
es: Detalles:

# ValidationEmailRequired
source: Email is required.
es: El correo es obligatorio.

# ValidationEmailInvalid
source: Email format is invalid.
es: El formato del correo no es válido.

# ValidationPasswordRequired
source: Password is required.
es: La contraseña es obligatoria.

# ValidationFirstNameRequired
source: First name is required.
es: El nombre es obligatorio.

# ValidationLastNameRequired
source: Last name is required.
es: El apellido es obligatorio.

# ValidationUsernameRequired
source: Username is required.
es: El nombre de usuario es obligatorio.

# ValidationUsernameLength
source: Username must be between 3 and 16 characters.
es: El nombre de usuario debe tener entre 3 y 16 caracteres.

# ValidationPasswordPolicy
source: Password must be 8+ chars, 1 uppercase, 1 lowercase, 1 number, and 1 symbol.
es: La contraseña debe tener 8+ caracteres, 1 mayúscula, 1 minúscula, 1 número y 1 símbolo.

# ValidationBirthDateRequired
source: Date of birth is required.
es: La fecha de nacimiento es obligatoria.

# ValidationBirthDateInvalid
source: You must be at least 13 years old and the date cannot be in the future.
es: Debes tener entre 13 y 100 años.

# ValidationGenderRequired
source: You must select a gender option.
es: Debes seleccionar un género.

# ErrorMsgSignUpFailed
source: An unexpected error occurred while registering the account.
es: Ocurrió un error inesperado al registrar la cuenta.

# ValidationVerificationCodeRequired
source: Code is required.
es: El código es obligatorio.

# ValidationVerificationCodeFormat
source: The code must be 6 numeric digits.
es: El código debe ser de 6 dígitos numéricos.

# ErrorMsgVerifyFailed
source: An error occurred while verifying the account.
es: Ocurrió un error al verificar la cuenta.

# InfoMsgVerifySuccessTitle
source: Account Verified
es: Cuenta Verificada

# InfoMsgVerifySuccessBody
source: Your account has been verified! You can now log in.
es: ¡Tu cuenta ha sido verificada! Ahora puedes iniciar sesión.

# InfoMsgResendSuccessTitle
source: Code Sent
es: Código Enviado

# InfoMsgResendSuccessBody
source: A new verification code has been sent to your email.
es: Se ha enviado un nuevo código de verificación a tu correo.

# ValidationPasswordNewRequired
source: New password is required.
es: La nueva contraseña es obligatoria.

# ValidationPasswordConfirmRequired
source: Please confirm your password.
es: Debes confirmar la contraseña.

# ValidationPasswordRecoveryCodeSent
source: A recovery code has been sent to your email.
es: Se ha enviado un código de recuperación a tu correo.

# InfoMsgPasswordResetSuccessTitle
source: Password Reset
es: Contraseña Restablecida

# InfoMsgPasswordResetSuccessBody
source: Your password has been changed successfully. You may now log in.
es: Tu contraseña se ha cambiado con éxito. Ya puedes iniciar sesión.

# ErrorMsgPasswordResetFailed
source: An error occurred while resetting your password.
es: Ocurrió un error al restablecer tu contraseña.

# ValidationLobbyCodeRequired
source: Lobby code is required.
es: El código de sala es obligatorio.

# ValidationLobbyCodeFormat
source: Code must be 6 alphanumeric characters.
es: El código debe tener 6 caracteres alfanuméricos.

# ErrorMsgGuestJoinFailed
source: An error occurred while joining the lobby.
es: Ocurrió un error al unirse a la sala.

# WarningMsgSocialConnectFailedGuest
source: Could not connect to social features. Chat might not work correctly.
es: No se pudo conectar a las funciones sociales. El chat podría no funcionar.

# KickPlayerTitle
source: Kick Player
es: Expulsar Jugador

# KickPlayerMessage
source: Are you sure you want to kick {0}?
es: ¿Seguro que quieres expulsar a {0}?

# Need4PlayersError
source: Need 4 players to start.
es: Se necesitan 4 jugadores para empezar.

# GameStartError
source: Error starting game.
es: Error al iniciar la partida

# KickedMessage
source: You have been kicked from the lobby. Reason: {0}
es: Has sido expulsado de la sala. Razón: {0}

# KickedTitle
source: Kicked
es: Expulsado

# InviteSentTitle
source: Invitation Sent
es: Invitación Enviada

# InviteSentBody
source: Invitation sent to {0}.
es: Invitación enviada a {0}.

# LoadFriendsError
source: Error loading friends list
es: Error al cargar amigos

# SendInviteError
source: Error sending lobby invite
es: Error al enviar invitación

# SendChatError
source: Failed to send message: {0}
es: Error al enviar mensaje: {0}

# ChatConnectError
source: Could not connect to lobby chat.
es: No se pudo conectar al chat de la sala.

# GuestInviteError
source: Error sending guest invitation.
es: Error al enviar invitación de invitado.

source: Error leaving lobby.
es: Error al salir de la sala.

source: Error kicking player.
es: Error al expulsar al jugador.

# GlobalLbLoading
source: Loading...
es: Cargando...

# GlobalLbNotSpecified
source: Not specified
es: No especificado

# InviteReceivedBody
source: You received an invitation from {0} to join lobby {1}.
es: Recibiste una invitación de {0} para unirte a la sala {1}.

# InviteReceivedTitle
source: Lobby Invitation
es: Invitación de Sala

# ErrorSessionExpired
source: Your session has expired. Cannot join lobby.
es: Tu sesión ha expirado. No se puede unir a la sala.

# ErrorJoiningLobby
source: An error occurred while trying to join the lobby.
es: Ocurrió un error al intentar unirse a la sala.

# ValidationCurrentPasswordRequired
source: Current password is required.
es: La contraseña actual es obligatoria.

# EditProfileLbCurrentPassword
source: Current Password
es: Contraseña Actual

source: Error changing password.
es: Error al cambiar la contraseña.

# ProfileUpdateSuccess
source: Profile updated successfully!
es: Perfil actualizado exitosamente.

# ProfileUpdateError
source: Error updating profile.
es: Error al actualizar el perfil.

# PostMatchLbTitle
source: Match Results
es: Resultados de la Partida

# PostMatchLbWinner
source: WINNER
es: ¡GANADOR!

# PostMatchHeaderRank
source: Rank
es: Pos.

# PostMatchHeaderPlayer
source: Player
es: Jugador

# PostMatchHeaderPieces
source: Pieces
es: Piezas

# PostMatchBtnBackToLobby
source: Back to Lobby
es: Volver al Lobby

# PostMatchBtnMainMenu
source: Main Menu
es: Menú Principal

# SocialToolTipRemoveFriend
source: Remove friend
es: Eliminar amigo

# ErrorLoadingFriends
source: Error loading friends list.
es: Error al cargar la lista de amigos.

# ErrorLoadingRequests
source: Error loading friend requests.
es: Error al cargar las solicitudes de amistad.

# ErrorSearchingPlayer
source: Error searching players.
es: Error al buscar jugadores.

# ErrorSendingRequest
source: Error sending friend request.
es: Error al enviar la solicitud de amistad.

# ErrorRespondingRequest
source: Error responding to request.
es: Error al responder a la solicitud.

# SocialConfirmRemove
source: Are you sure you want to remove {0}?
es: ¿Estás seguro de que quieres eliminar a {0}?

# SocialConfirmRemoveTitle
source: Confirm Removal
es: Confirmar Eliminación

source: Error removing friend.
es: Error al eliminar al amigo.

# SocialInfoNewRequest
source: You have received a new friend request from {0}.
es: Has recibido una nueva solicitud de amistad de {0}.

# SocialInfoNewRequestTitle
source: New Friend Request
es: Nueva Solicitud de Amistad

# SocialInfoRequestAccepted
source: {0} has accepted your friend request.
es: {0} ha aceptado tu solicitud de amistad.

# SocialInfoNewFriendTitle
source: New Friend!
es: ¡Nuevo Amigo!

# SocialInfoRequestDeclined
source: {0} has declined your friend request.
es: {0} ha rechazado tu solicitud de amistad.

# SocialInfoRequestDeclinedTitle
source: Request Declined
es: Solicitud Rechazada

# RestartRequiredTitle
source: Restart Required
es: Reinicio Requerido

# RestartRequiredMessage
source: Language changed. The application needs to restart to apply changes. Restart now?
es: El idioma ha cambiado. La aplicación necesita reiniciarse para aplicar los cambios. ¿Reiniciar ahora?

# CreditsContent
source: Mind Weave\nDeveloped by:\nAldo Antonio Campos Gómez\nAngel Jonathan Puch Hernández\n\n© 2025
es: Mind Weave\nDesarrollado por:\nAldo Antonio Campos Gómez\nAngel Jonathan Puch Hernández\n\n© 2025

# CannotAcceptInviteAlreadyInGame
source: Cannot accept invitation while already in a game.
es: No se puede aceptar una invitación mientras ya se está dentro de una partida.

# ErrorImageTooLarge
source: The image is too large. Max size is {0}MB.
es: La imagen es demasiado grande. El tamaño máximo es {0}MB.

source: Error reading file
es: Error al leer el archivo

source: Error processing file
es: Error al procesar el archivo

# ErrorReadingPuzzleBytes
source: Error reading puzzle file bytes for ID {0}.
es: Error al leer los bytes del archivo de rompecabezas para el ID {0}.

# ErrorFileTooBigForServer
source: The selected file is too large for the server configuration.
es: El archivo seleccionado es demasiado grande para la configuración del servidor.

# GameBtnViewImage
source: View Image
es: Ver Imagen

# GameTxtClose
source: Close
es: Cerrar

# SystemMessageBlocked
source: [SYSTEM] Message blocked. Strike {0}/3. Watch your language.
es: [SISTEMA] Mensaje bloqueado. Strike {0}/3. Cuida tu lenguaje.

# SystemHostExpelled
source: Lobby closed because the host was expelled.
es: La sala se cerró porque el anfitrión fue expulsado.

# AchievementUnlockedTitle
source: ACHIEVEMENT UNLOCKED!
es: ¡LOGRO DESBLOQUEADO!

# AchievementNoviceWeaver
source: Novice Weaver
es: Tejedor Novato

# AchievementPuzzleMaster
source: Puzzle Master
es: Maestro de los Puzzles

# AchievementPieceCollector
source: Piece Collector
es: Coleccionista de Piezas

# AchievementTimeWarp
source: Time Warp
es: Salto en el Tiempo

# AchievementFirstVictory
source: First Victory
es: Primera Victoria

# AchievementHighScorer
source: High Scorer
es: Puntuación Alta

# AchievementSpeedDemon
source: Speed Demon
es: Demonio de la Velocidad

# AchievementHardcoreGamer
source: Hardcore Gamer
es: Jugador Intenso

# AchievementHostWithTheMost
source: Host with the Most
es: El Anfitrión

# AchievementSubjectZero
source: Subject Zero
es: Sujeto Cero

# AchievementParticipationAward
source: Participation Award
es: Premio de Participación

# AchievementJustBeginning
source: Just Beginning
es: Apenas el Comienzo

# MainMenuBtnLogOut
source: LOG OUT
es: CERRAR SESIÓN

# GlobalBtnExit
source: Exit Game
es: Salir del Juego

# MainMenuBtnExit
source: EXIT GAME
es: SALIR DEL JUEGO

# GlobalExitConfirmTitle
source: Exit Mind Weave
es: Salir de Mind Weave

# GlobalExitConfirmMessage
source: Are you sure you want to exit Mind Weave?
es: ¿Estás seguro de que deseas salir de Mind Weave?

# GameExitConfirmTitle
source: Abandon Match?
es: ¿Abandonar Partida?

# GameExitConfirmMessage
source: Game in progress! If you leave now, you will lose your current progress (pieces placed). Only your playtime will be saved. Exit anyway?
es: ¡Partida en curso! Si sales ahora, perderás tu progreso actual (piezas colocadas). Solo se guardará tu tiempo de juego. ¿Salir de todos modos?

# ErrorConnectionLostTitle
source: Connection Error
es: Error de Conexión

# ErrorConnectionLost
source: Connection to server lost. You will be redirected to login.
es: Se ha perdido la conexión con el servidor. Serás redirigido al inicio de sesión.

# ErrorServiceNotFound
source: Could not connect to the server. Please verify the server is running and try again.
es: No se pudo conectar al servidor. Verifica que el servidor esté ejecutándose e intenta de nuevo.

# ErrorServerTimeout
source: The server is not responding. Please check your network connection and try again.
es: El servidor no responde. Verifica tu conexión de red e intenta de nuevo.

# ErrorConnectionTerminated
source: The connection was terminated unexpectedly. You will be redirected to login.
es: La conexión se terminó inesperadamente. Serás redirigido al inicio de sesión.

# ErrorServerBusy
source: The server is too busy to handle your request. Please try again later.
es: El servidor está muy ocupado para procesar tu solicitud. Intenta más tarde.

# ErrorConnectionRefused
source: Connection refused by server. Please verify the server is running.
es: Conexión rechazada por el servidor. Verifica que el servidor esté ejecutándose.

# ErrorConnectionReset
source: The connection was reset by the server. You will be redirected to login.
es: La conexión fue reiniciada por el servidor. Serás redirigido al inicio de sesión.

# ErrorNetworkUnreachable
source: Cannot reach the server. Please check your network connection.
es: No se puede alcanzar el servidor. Verifica tu conexión de red.

# ErrorHostNotFound
source: Server not found. Please verify the server address in configuration.
es: Servidor no encontrado. Verifica la dirección del servidor en la configuración.

# ErrorSecurityNegotiation
source: Security negotiation failed. Please contact support.
es: La negociación de seguridad falló. Contacta a soporte.

# ErrorMessageSecurity
source: Message security error. Please try again.
es: Error de seguridad del mensaje. Intenta de nuevo.

# ErrorQuotaExceeded
source: The message size exceeds the allowed limit.
es: El tamaño del mensaje excede el límite permitido.

# ErrorProtocol
source: Protocol error communicating with the server.
es: Error de protocolo al comunicarse con el servidor.

# ErrorActionNotSupported
source: The requested action is not supported.
es: La acción solicitada no está soportada.

# ErrorInvalidOperation
source: The operation could not be completed. Please try again.
es: La operación no pudo completarse. Intenta de nuevo.
