Repository: AngelPuch/MindWeaveClient
Catalog: MindWeaveClient/Properties/Langs/Lang.*.resx
Languages: es

# ErrorInvalidData
source: Invalid data provided. Please check your input and try again.
es: Datos inválidos proporcionados. Revisa tu entrada e intenta de nuevo.

# ErrorGenericOperation
source: An error occurred during {0}. Please try again.
es: Ocurrió un error durante {0}. Intenta de nuevo.

# GlobalLbUnknown
source: unknown operation
es: operación desconocida

# LoginOperation
source: login
es: inicio de sesión

# ResendCodeOperation
source: resend verification code
es: reenvío de código de verificación

# RegistrationOperation
source: registration
es: registro

# VerificationOperation
source: account verification
es: verificación de cuenta

# PasswordRecoveryOperation
source: password recovery
es: recuperación de contraseña

# GuestJoinOperation
source: guest join
es: unión como invitado

# JoinLobbyOperation
source: join lobby
es: unión a sala

# LoadProfileOperation
source: load profile
es: carga de perfil

# LoadAchievementsOperation
source: load achievements
es: carga de logros

# ChangePasswordOperation
source: change password
es: cambio de contraseña

# UpdateProfileOperation
source: update profile
es: actualización de perfil

# LoadFriendsOperation
source: load friends list
es: carga de lista de amigos

# LoadRequestsOperation
source: load friend requests
es: carga de solicitudes de amistad

# SearchPlayersOperation
source: search players
es: búsqueda de jugadores

# SendFriendRequestOperation
source: send friend request
es: envío de solicitud de amistad

# RespondFriendRequestOperation
source: respond to friend request
es: respuesta a solicitud de amistad

# RemoveFriendOperation
source: remove friend
es: eliminación de amigo

# UpdateAvatarOperation
source: update avatar
es: actualización de avatar

# LoadPuzzlesOperation
source: load puzzles
es: carga de puzzles

# UploadPuzzleOperation
source: upload puzzle
es: subida de puzzle

# CreateLobbyOperation
source: create lobby
es: creación de sala

# DragPieceOperation
source: drag piece
es: arrastre de pieza

# DropPieceOperation
source: drop piece
es: soltar pieza

# ErrorNoPiecesInPuzzle
source: Error: No pieces found in puzzle definition.
es: Error: No hay piezas en la definición del puzzle.

# ErrorCriticalTitle
source: Critical Error
es: Error Crítico

# ErrorProcessingPuzzle
source: Error processing puzzle: {0}
es: Error al procesar puzzle: {0}

# GameEndTimeoutTitle
source: Time's Up!
es: ¡Tiempo Agotado!

# GameEndTimeoutMessage
source: The match time has expired.
es: Se acabó el tiempo de la partida.

# GameEndForfeitTitle
source: Victory by Forfeit!
es: ¡Victoria por Abandono!

# GameEndForfeitMessage
source: Your opponents have left the match. You win!
es: Tus rivales han abandonado la partida. ¡Has ganado!

# GameEndCompletedTitle
source: Puzzle Completed!
es: ¡Puzzle Completado!

# GameEndCompletedMessage
source: The puzzle has been solved.
es: El rompecabezas ha sido resuelto.

# GameEndLoadingResults
source: {0} Loading results...
es: {0} Cargando resultados...

# StartGameOperation
source: start game
es: inicio de juego

# KickPlayerOperation
source: kick player
es: expulsar jugador

# InviteFriendOperation
source: invite friend
es: invitar amigo

# InviteGuestOperation
source: invite guest
es: invitar invitado

# SendMessageOperation
source: send message
es: envío de mensaje

# LobbyClosedTitle
source: Lobby Closed
es: Sala Cerrada

# ErrorRestartFailed
source: Failed to restart the application. Please restart manually.
es: No se pudo reiniciar la aplicación. Por favor reinicie manualmente.

# ErrorNoInternetTitle
source: No Internet Connection
es: Sin Conexión a Internet

# ErrorNoInternetConnection
source: No internet connection. Please check your network settings and try again.
es: No hay conexión a internet. Por favor revisa tu configuración de red e intenta de nuevo.

# ErrorNetworkDown
source: Your network connection is down. Please check your internet connection.
es: Tu conexión de red está caída. Por favor revisa tu conexión a internet.

# ErrorNotConnectedToNetwork
source: You are not connected to a network. Please connect to the internet and try again.
es: No estás conectado a una red. Por favor conéctate a internet e intenta de nuevo.

# ErrorHostDown
source: The remote server appears to be down. Please try again later.
es: El servidor remoto parece estar caído. Por favor intenta más tarde.

# ErrorNetworkNotReady
source: Network subsystem is not ready. Please wait a moment and try again.
es: El subsistema de red no está listo. Por favor espera un momento e intenta de nuevo.

# ErrorDnsResolutionFailed
source: Could not resolve server address. Please check your internet connection.
es: No se pudo resolver la dirección del servidor. Por favor revisa tu conexión a internet.

# ErrorCannotConnectToNetwork
source: Cannot connect to the network. Please verify your internet connection is working.
es: No se puede conectar a la red. Por favor verifica que tu conexión a internet funcione.

# ErrorServerWentDown
source: The server connection was lost. The server may have gone down.
es: Se perdió la conexión con el servidor. El servidor puede haberse caído.
